<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"4f346907f0655f5c568283a1dda5ae2e27a0614a126649c6d5da13c81531d0e6","plan_job_ref":"Job Environment Main - Plan #1598 at https://github.com/jarrod-lowe/wildsea/actions/runs/17089973112","plan_out_hash":"be4b1617a9e2a30bc8b37c6fdfa0b1822d34253ed9009f555f6792d995ad2d36","plan_hash":"a2be3b989871750b4c8e9f5add9f514678e51fd4d92259e30618fc19cb7a46e8","plan_text_format":"diff","version":"2.2.2"} -->
Terraform plan in __terraform/environment/wildsea__
With backend config: `bucket=terraform-state-021891603679 key=primary/terraform.tfstate region=ap-southeast-2`<details open><summary>With variables</summary>

```hcl
domain_name          = "wildsea.lowe.kiwi"
environment          = "primary"
google_client_id     = (sensitive value)
google_client_secret = (sensitive value)
saml_metadata_url    = (sensitive value)
```
</details>
<details>
<summary>Plan: 1 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.wildsea.data.aws_iam_policy_document.ui will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ui" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:s3:::wildsea-primary-ui/*",
            ]
+           sid       = "CDNRead"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "arn:aws:cloudfront::021891603679:distribution/E2KPUTZ78NDDZ6",
                ]
+               variable = "aws:SourceArn"
            }

+           principals {
+               identifiers = [
+                   "cloudfront.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:s3:::wildsea-primary-ui",
            ]
+           sid       = "CDNList"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "arn:aws:cloudfront::021891603679:distribution/E2KPUTZ78NDDZ6",
                ]
+               variable = "aws:SourceArn"
            }

+           principals {
+               identifiers = [
+                   "cloudfront.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
+       statement {
+           actions   = [
+               "s3:*",
            ]
+           effect    = "Deny"
+           resources = [
+               "arn:aws:s3:::wildsea-primary-ui",
+               "arn:aws:s3:::wildsea-primary-ui/*",
            ]
+           sid       = "BlockHTTP"

+           condition {
+               test     = "Bool"
+               values   = [
+                   "false",
                ]
+               variable = "aws:SecureTransport"
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "AWS"
            }
        }
    }

  # module.wildsea.aws_cloudfront_distribution.cdn will be updated in-place
!~  resource "aws_cloudfront_distribution" "cdn" {
        id                              = "E2KPUTZ78NDDZ6"
        tags                            = {
            "Name" = "Wildsea-primary-cdn"
        }
#        (22 unchanged attributes hidden)

!~      default_cache_behavior {
#            (16 unchanged attributes hidden)

+           function_association {
+               event_type   = "viewer-request"
+               function_arn = (known after apply)
            }
        }

#        (3 unchanged blocks hidden)
    }

  # module.wildsea.aws_cloudfront_function.spa_routing will be created
+   resource "aws_cloudfront_function" "spa_routing" {
+       arn             = (known after apply)
+       code            = <<-EOT
            function handler(event) {
                var request = event.request;
                var uri = request.uri;
                
                // If the URI doesn't contain a file extension and isn't the root
                // redirect to index.html to let React Router handle it
                if (!uri.includes('.') && uri !== '/') {
                    request.uri = '/index.html';
                }
                
                return request;
            }
        EOT
+       comment         = "SPA routing function to handle client-side routing"
+       etag            = (known after apply)
+       id              = (known after apply)
+       live_stage_etag = (known after apply)
+       name            = "Wildsea-primary-spa-routing"
+       publish         = true
+       runtime         = "cloudfront-js-1.0"
+       status          = (known after apply)
    }

  # module.wildsea.aws_s3_bucket_policy.ui will be updated in-place
!~  resource "aws_s3_bucket_policy" "ui" {
        id     = "wildsea-primary-ui"
!~      policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "s3:GetObject"
-                       Condition = {
-                           StringEquals = {
-                               "aws:SourceArn" = "arn:aws:cloudfront::021891603679:distribution/E2KPUTZ78NDDZ6"
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "cloudfront.amazonaws.com"
                        }
-                       Resource  = "arn:aws:s3:::wildsea-primary-ui/*"
-                       Sid       = "CDNRead"
                    },
-                   {
-                       Action    = "s3:ListBucket"
-                       Condition = {
-                           StringEquals = {
-                               "aws:SourceArn" = "arn:aws:cloudfront::021891603679:distribution/E2KPUTZ78NDDZ6"
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "cloudfront.amazonaws.com"
                        }
-                       Resource  = "arn:aws:s3:::wildsea-primary-ui"
-                       Sid       = "CDNList"
                    },
-                   {
-                       Action    = "s3:*"
-                       Condition = {
-                           Bool = {
-                               "aws:SecureTransport" = "false"
                            }
                        }
-                       Effect    = "Deny"
-                       Principal = {
-                           AWS = "*"
                        }
-                       Resource  = [
-                           "arn:aws:s3:::wildsea-primary-ui/*",
-                           "arn:aws:s3:::wildsea-primary-ui",
                        ]
-                       Sid       = "BlockHTTP"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
#        (1 unchanged attribute hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Environment Main - Plan #1598](https://github.com/jarrod-lowe/wildsea/actions/runs/17089973112)